spec/core/index.org
#+html_head: <link rel="stylesheet" href="../../doc-style.css" type="text/css"/>
#+title: Core
#+options: num:nil toc:nil


* Types

* Syntactic Terms/Formers
+ def :: Define a new value. Can only be used as a toplevel term in a module.
  When defining procedures with =proc=, the procedure may refer to its own name
  recursively. 

  Format: =(def <name> <value>)= 

  Sample usage:
  #+begin_src relic
(def x 10)
(def sum-to proc [x] if (< x 1) x (+ x (sum-to (- x 1)))))
  #+end_src

+ declare :: Declare that a value has certain properties. Canonly be used as a
  toplevel term in a module.

+ import :: Used to import names into the current module. Can only be used in
  scripts, but uses the same format as module imports.

  Format: =(import <import-clause>*)=

  Sample usage:
  #+begin_src relic 
(import
  (data.list :all)

  (data.string :as str)

  (data.pointer :only (new delete))

  platform.terminal)
  #+end_src

