spec/core/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-05-31 Sun 13:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Core</title>
<meta name="author" content="Connor Fynn Redfern" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../../doc-style.css" type="text/css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Core</h1>
<div id="outline-container-orgc3992c8" class="outline-2">
<h2 id="orgc3992c8">Types</h2>
</div>

<div id="outline-container-orgbd48c6e" class="outline-2">
<h2 id="orgbd48c6e">Syntactic Terms/Formers</h2>
<div class="outline-text-2" id="text-orgbd48c6e">
<dl class="org-dl">
<dt>def</dt><dd><p>
Define a new value. Can only be used as a toplevel term in a module.
When defining procedures with <code>proc</code>, the procedure may refer to its own name
recursively. 
</p>

<p>
Format: <code>(def &lt;name&gt; &lt;value&gt;)</code> 
</p>

<p>
Sample usage:
</p>
<div class="org-src-container">
<pre class="src src-relic">(<span style="color: #9d81ba;">def</span> x <span style="color: #0D9C94;">10</span>)
(<span style="color: #9d81ba;">def</span> sum-to <span style="color: #9d81ba;">proc</span> [x] <span style="color: #9d81ba;">if</span> (&lt; x <span style="color: #0D9C94;">1</span>) x (+ x (sum-to (- x <span style="color: #0D9C94;">1</span>)))))
</pre>
</div></dd>

<dt>declare</dt><dd>Declare that a value has certain properties. Canonly be used as a
toplevel term in a module.</dd>

<dt>import</dt><dd><p>
Used to import names into the current module. Can only be used in
scripts, but uses the same format as module imports.
</p>

<p>
Format: <code>(import &lt;import-clause&gt;*)</code>
</p>

<p>
Sample usage:
</p>
<div class="org-src-container">
<pre class="src src-relic">(<span style="color: #9d81ba;">import</span>
  (data<span style="color: #7CF083;">.list</span> :<span style="color: #9d81ba;">all</span>)

  (data<span style="color: #7CF083;">.string</span> <span style="color: #7CF083;">:as</span> str)

  (data<span style="color: #7CF083;">.pointer</span> <span style="color: #7CF083;">:only</span> (new delete))

  platform<span style="color: #7CF083;">.terminal</span>)
</pre>
</div></dd>
</dl>
</div>
