spec/core/index.org
** Create and Consume Values
+ proc :: Create a new procedure (function). Procedures are anonymous functions
  whose return value is the value their body evaluates to. Procedures cannot
  capture values from greater lexical contexts.

  Procedures have two argument lists, the reglar argument list, denoted by
  brackets ('[' and ']'), and the implicit argument list, denoted by braces ('{'
  and '}'). The implicit argument list can only take arguments that have a trait
  type.   

  Note that impicit arguments are most useful when used in conjunction with the
  =all= term former.

  Format: =(proc {(<arg> <Type>)*}? [<<arg> | (<arg> <Type>)>*] <body>)=

  Sample usage:
  #+begin_src relic 
;; write a string to the console  
(proc [x] (write-string x))

;; do 3 + 7
((proc [x] (+ x 7)) 3)

;; square an integer
(proc [(x I64)] (* x x))

;; square any value implementing the num trait 
(all [A] proc {(num (Num A))} [(x A)] (num.* x x))
  #+end_src

+ all :: Create a new universally quantified value. When used in cojunction with
  the =proc= term former, the resultant value behaves as a single procedure,
  which requires all arguments be instantiated to run.

 Format: =(all [<arg>*] ,<body>)= 
 
  Sample usage:
  #+begin_src relic 
(all [A] memory.alloc (size-of A))

(all [A] proc [(x A)] x)
  #+end_src

+ macro :: Convert a procedure into a macro. Macros can only be formed from
  procedures with type =Proc [Syntax] (Either String Syntax)=

 Format: =(macro ,<proc>)= 
 
  Sample usage:
  #+begin_src relic 
(all [A] memory.alloc (size-of A))

(all [A] proc [(x A)] x)
  #+end_src

+ apply :: explicitly apply a function to some value(s). Using apply to
  apply a procedure =p= to arguments =a b c= is the same as =(p a b c)=,
  however, if =p= is not a procedure but is rather a macro or term-former, then
  then =apply= will produce a type error.

+ array :: Create a new array value, i.e. collection of values of the same type
  laid out contiguously in memory. Arrays may be multidimensional. 

 Format: =(array {n m ...}? [[a b c] [d e f] ...])= 
 
  Sample usage:
  #+begin_src relic 
;; 1D array, with dimension
(array {4} [3 7 1 9])

;; 1D array, without dimension
(array [#a #b #c])

;; 2D array, leftmost number in dimension is size of outermost array
(array {3 2} [[1 2] [3 4] [5 6]])
  #+end_src

+ struct :: Create a new structured value, heterogenously associating names with values

 Format: =(struct <Type>? [.name val] [.name val] ...)= 
  
  Sample usage:
  #+begin_src relic 
(struct [.x 37] [.y 10] [.z 32])

(def Range Struct [.start F32] [.end F32])
(struct Range [.start 1.5] [.end 7.34])
  #+end_src

+ . :: Projector - project a value out of a structure. May 

 Format: =(val.field)= or =(.field val)=

  Sample usage:
  #+begin_src relic 
(.x (struct [.x 37] [.y 10]))

(point.x)
  #+end_src

+ : :: Enum constructor - construct a value from an enum type.

  Format: =:val= or =Type:val= or =(:val <arg1> ...)= or =(Type:val <arg1> ...)=

  #+begin_src relic

  #+end_src

+ match :: Matches a value against patterns deriving from types like Enums or Tagged Variants. Each pattern specifies how the value is destructured and evaluated.

 Format: =(match value [pattern body] ...)=
 
 Sample usage:
  #+begin_src relic
;; Define a simple enum type with two variants
(def Result Enum [:ok I32] [:error String])

;; A match statement handling both variants
(match (Result:ok 42)
  [[:ok num] (terminal.write-line (str "Success with number: " num))]
  [[:error msg] (terminal.write-line (str "Error occurred: " msg))])
  #+end_src

+ seal :: Create a new term that will seal away a type from a value. 

 Format: =(seal type [T1 T2 ...] {i1 i2 ...}? ,<body>)=

  #+begin_src relic
(def Mon Sealed [A] Struct
  [.val A]
  [.stringify Proc [A] String])

(seal Mon [I64] struct
  [.val 10]
  [.stringify i64.to-string])
  #+end_src

+ unseal :: Unseal types in a sealed value, binding specified fields for use.

 Format: =(unseal [name value] [T1 T2 ...] [implicit-binding]? ,<body>)=
 
 Sample usage:
  #+begin_src relic
(unseal [mon x] [I64]
  (.val mon)) ;; Unseals the .val from a sealed type.
  #+end_src

+ dynamic :: Establish a new dynamic value. Dynamic values are a special kind of
  mutable vaule. Conceptually, dynamic values are pointers to a value on the
  stack. When using =bind=, a new binding for the value is established, and both
  reads and modifications will read from the new value, but when the function
  containing the =bind= returns, the dynamic value will update to point at the
  OLD value. The 'initial' value establishes a 'hidden' binding at the top of
  the current call-stack.  

 Format: =(dynamic <initial_value>)=

 Sample usage:
  #+begin_src relic
(def counter dynamic 0)
  #+end_src

+ use :: Access the current value of a dynamic cell.

 Format: =(use <dynamic>)=

 Sample usage:
  #+begin_src relic
(use counter)
  #+end_src

+ modify :: Modify the value of a dynamically scoped variable.
   
 Format: =(modify <dynamic> <new_value>)=

 Sample usage:
  #+begin_src relic
(modify counter (+ (use counter) 1))
  #+end_src

+ bind :: Establish a binding for a dynamic value. The change affects all accesses
  (including callees) within the scope, but all changes to the varible are
  reverted when leaving the bind.

 Format: =(bind [name value] ,<body>)=

 Sample usage:
  #+begin_src relic
(terminal.write-line (to-string counter)) ;; prints 0

(bind [counter 100]
  (modify counter (+ (use counter) 10))      
  (terminal.write-line (to-string counter))) ;; prints 110

(terminal.write-line (to-string counter)) ;; prints 0
  #+end_src

+ instance :: Bind values to typeclass traits dynamically.

 Format: =(instance type trait implementation)=

 Sample usage:
  #+begin_src relic
(instance I64 Num
  [(+ subtract multiply)])
  #+end_src

