spec/core/index.html
<div id="outline-container-org7ac3456" class="outline-3">
<h3 id="org7ac3456">Create and Consume Values</h3>
<div class="outline-text-3" id="text-org7ac3456">
<dl class="org-dl">
<dt>proc</dt><dd><p>
Create a new procedure (function). Procedures are anonymous functions
whose return value is the value their body evaluates to. Procedures cannot
capture values from greater lexical contexts.
</p>

<p>
Procedures have two argument lists, the reglar argument list, denoted by
brackets ('[' and ']'), and the implicit argument list, denoted by braces ('{'
and '}'). The implicit argument list can only take arguments that have a trait
type.   
</p>

<p>
Note that impicit arguments are most useful when used in conjunction with the
<code>all</code> term former.
</p>

<p>
Format: <code>(proc {(&lt;arg&gt; &lt;Type&gt;)*}? [&lt;&lt;arg&gt; | (&lt;arg&gt; &lt;Type&gt;)&gt;*] &lt;body&gt;)</code>
</p>

<p>
Sample usage:
</p>
<div class="org-src-container">
<pre class="src src-relic"><span style="color: #454459;">;; </span><span style="color: #454459;">write a string to the console  
</span>(<span style="color: #9d81ba;">proc</span> [x] (write-string x))

<span style="color: #454459;">;; </span><span style="color: #454459;">do 3 + 7
</span>((<span style="color: #9d81ba;">proc</span> [x] (+ x <span style="color: #0D9C94;">7</span>)) <span style="color: #0D9C94;">3</span>)

<span style="color: #454459;">;; </span><span style="color: #454459;">square an integer
</span>(<span style="color: #9d81ba;">proc</span> [(x <span style="color: #62D2DB;">I64</span>)] (* x x))

<span style="color: #454459;">;; </span><span style="color: #454459;">square any value implementing the num trait 
</span>(<span style="color: #9d81ba;">all</span> [<span style="color: #62D2DB;">A</span>] <span style="color: #9d81ba;">proc</span> {(num (<span style="color: #62D2DB;">Num</span> <span style="color: #62D2DB;">A</span>))} [(x <span style="color: #62D2DB;">A</span>)] (num<span style="color: #7CF083;">.</span>* x x))
</pre>
</div></dd>

<dt>all</dt><dd><p>
Create a new universally quantified value. When used in cojunction with
the <code>proc</code> term former, the resultant value behaves as a single procedure,
which requires all arguments be instantiated to run.
</p>

<p>
Format: <code>(all [&lt;arg&gt;*] ,&lt;body&gt;)</code> 
</p>

<p>
Sample usage:
</p>
<div class="org-src-container">
<pre class="src src-relic">(<span style="color: #9d81ba;">all</span> [<span style="color: #62D2DB;">A</span>] memory<span style="color: #7CF083;">.alloc</span> (size-of <span style="color: #62D2DB;">A</span>))

(<span style="color: #9d81ba;">all</span> [<span style="color: #62D2DB;">A</span>] <span style="color: #9d81ba;">proc</span> [(x <span style="color: #62D2DB;">A</span>)] x)
</pre>
</div></dd>

<dt>macro</dt><dd><p>
Convert a procedure into a macro. Macros can only be formed from
procedures with type <code>Proc [Syntax] (Either String Syntax)</code>
</p>

<p>
Format: <code>(macro ,&lt;proc&gt;)</code> 
</p>

<p>
Sample usage:
</p>
<div class="org-src-container">
<pre class="src src-relic">(<span style="color: #9d81ba;">all</span> [<span style="color: #62D2DB;">A</span>] memory<span style="color: #7CF083;">.alloc</span> (size-of <span style="color: #62D2DB;">A</span>))

(<span style="color: #9d81ba;">all</span> [<span style="color: #62D2DB;">A</span>] <span style="color: #9d81ba;">proc</span> [(x <span style="color: #62D2DB;">A</span>)] x)
</pre>
</div></dd>

<dt>apply</dt><dd>explicitly apply a function to some value(s). Using apply to
apply a procedure <code>p</code> to arguments <code>a b c</code> is the same as <code>(p a b c)</code>,
however, if <code>p</code> is not a procedure but is rather a macro or term-former, then
then <code>apply</code> will produce a type error.</dd>

<dt>array</dt><dd><p>
Create a new array value, i.e. collection of values of the same type
laid out contiguously in memory. Arrays may be multidimensional. 
</p>

<p>
Format: <code>(array {n m ...}? [[a b c] [d e f] ...])</code> 
</p>

<p>
Sample usage:
</p>
<div class="org-src-container">
<pre class="src src-relic"><span style="color: #454459;">;; </span><span style="color: #454459;">1D array, with dimension
</span>(array {<span style="color: #0D9C94;">4</span>} [<span style="color: #0D9C94;">3</span> <span style="color: #0D9C94;">7</span> <span style="color: #0D9C94;">1</span> <span style="color: #0D9C94;">9</span>])

<span style="color: #454459;">;; </span><span style="color: #454459;">1D array, without dimension
</span>(array [#a #b #c])

<span style="color: #454459;">;; </span><span style="color: #454459;">2D array, leftmost number in dimension is size of outermost array
</span>(array {<span style="color: #0D9C94;">3</span> <span style="color: #0D9C94;">2</span>} [[<span style="color: #0D9C94;">1</span> <span style="color: #0D9C94;">2</span>] [<span style="color: #0D9C94;">3</span> <span style="color: #0D9C94;">4</span>] [<span style="color: #0D9C94;">5</span> <span style="color: #0D9C94;">6</span>]])
</pre>
</div></dd>

<dt>struct</dt><dd><p>
Create a new structured value, heterogenously associating names with values
</p>

<p>
Format: <code>(struct &lt;Type&gt;? [.name val] [.name val] ...)</code> 
</p>

<p>
Sample usage:
</p>
<div class="org-src-container">
<pre class="src src-relic">(<span style="color: #9d81ba;">struct</span> [<span style="color: #7CF083;">.x</span> <span style="color: #0D9C94;">37</span>] [<span style="color: #7CF083;">.y</span> <span style="color: #0D9C94;">10</span>] [<span style="color: #7CF083;">.z</span> <span style="color: #0D9C94;">32</span>])

(<span style="color: #9d81ba;">def</span> <span style="color: #62D2DB;">Range</span> <span style="color: #9d81ba;">Struct</span> [<span style="color: #7CF083;">.start</span> <span style="color: #62D2DB;">F32</span>] [<span style="color: #7CF083;">.end</span> <span style="color: #62D2DB;">F32</span>])
(<span style="color: #9d81ba;">struct</span> <span style="color: #62D2DB;">Range</span> [<span style="color: #7CF083;">.start</span> <span style="color: #0D9C94;">1</span>.<span style="color: #0D9C94;">5</span>] [<span style="color: #7CF083;">.end</span> <span style="color: #0D9C94;">7</span>.<span style="color: #0D9C94;">34</span>])
</pre>
</div></dd>

<dt>.</dt><dd><p>
Projector - project a value out of a structure. May 
</p>

<p>
Format: <code>(val.field)</code> or <code>(.field val)</code>
</p>

<p>
Sample usage:
</p>
<div class="org-src-container">
<pre class="src src-relic">(<span style="color: #7CF083;">.x</span> (<span style="color: #9d81ba;">struct</span> [<span style="color: #7CF083;">.x</span> <span style="color: #0D9C94;">37</span>] [<span style="color: #7CF083;">.y</span> <span style="color: #0D9C94;">10</span>]))

(point<span style="color: #7CF083;">.x</span>)
</pre>
</div></dd>

<dt>:</dt><dd><p>
Enum constructor - construct a value from an enum type.
</p>

<p>
Format: <code>:val</code> or <code>Type:val</code> or <code>(:val &lt;arg1&gt; ...)</code> or <code>(Type:val &lt;arg1&gt; ...)</code>
</p>

<div class="org-src-container">
<pre class="src src-relic">
</pre>
</div></dd>

<dt>match</dt><dd><p>
Matches a value against patterns deriving from types like Enums or Tagged Variants. Each pattern specifies how the value is destructured and evaluated.
</p>

<p>
Format: <code>(match value [pattern body] ...)</code>
</p>

<p>
Sample usage:
</p>
<div class="org-src-container">
<pre class="src src-relic"><span style="color: #454459;">;; </span><span style="color: #454459;">Define a simple enum type with two variants
</span>(<span style="color: #9d81ba;">def</span> <span style="color: #62D2DB;">Result</span> <span style="color: #9d81ba;">Enum</span> [<span style="color: #7CF083;">:ok</span> <span style="color: #62D2DB;">I32</span>] [<span style="color: #7CF083;">:error</span> <span style="color: #62D2DB;">String</span>])

<span style="color: #454459;">;; </span><span style="color: #454459;">A match statement handling both variants
</span>(<span style="color: #9d81ba;">match</span> (<span style="color: #62D2DB;">Result</span><span style="color: #7CF083;">:ok</span> <span style="color: #0D9C94;">42</span>)
  [[<span style="color: #7CF083;">:ok</span> num] (terminal<span style="color: #7CF083;">.write-line</span> (str <span style="color: #f5c791;">"Success with number: "</span> num))]
  [[<span style="color: #7CF083;">:error</span> msg] (terminal<span style="color: #7CF083;">.write-line</span> (str <span style="color: #f5c791;">"Error occurred: "</span> msg))])
</pre>
</div></dd>

<dt>seal</dt><dd><p>
Create a new term that will seal away a type from a value. 
</p>

<p>
Format: <code>(seal type [T1 T2 ...] {i1 i2 ...}? ,&lt;body&gt;)</code>
</p>

<div class="org-src-container">
<pre class="src src-relic">(<span style="color: #9d81ba;">def</span> <span style="color: #62D2DB;">Mon</span> <span style="color: #9d81ba;">Sealed</span> [<span style="color: #62D2DB;">A</span>] <span style="color: #9d81ba;">Struct</span>
  [<span style="color: #7CF083;">.val</span> <span style="color: #62D2DB;">A</span>]
  [<span style="color: #7CF083;">.stringify</span> <span style="color: #9d81ba;">Proc</span> [<span style="color: #62D2DB;">A</span>] <span style="color: #62D2DB;">String</span>])

(<span style="color: #9d81ba;">seal</span> <span style="color: #62D2DB;">Mon</span> [<span style="color: #62D2DB;">I64</span>] <span style="color: #9d81ba;">struct</span>
  [<span style="color: #7CF083;">.val</span> <span style="color: #0D9C94;">10</span>]
  [<span style="color: #7CF083;">.stringify</span> i64<span style="color: #7CF083;">.to-string</span>])
</pre>
</div></dd>

<dt>unseal</dt><dd><p>
Unseal types in a sealed value, binding specified fields for use.
</p>

<p>
Format: <code>(unseal [name value] [T1 T2 ...] [implicit-binding]? ,&lt;body&gt;)</code>
</p>

<p>
Sample usage:
</p>
<div class="org-src-container">
<pre class="src src-relic">(<span style="color: #9d81ba;">unseal</span> [mon x] [<span style="color: #62D2DB;">I64</span>]
  (<span style="color: #7CF083;">.val</span> mon)) <span style="color: #454459;">;; </span><span style="color: #454459;">Unseals the .val from a sealed type.</span>
</pre>
</div></dd>

<dt>dynamic</dt><dd><p>
Establish a new dynamic value. Dynamic values are a special kind of
mutable vaule. Conceptually, dynamic values are pointers to a value on the
stack. When using <code>bind</code>, a new binding for the value is established, and both
reads and modifications will read from the new value, but when the function
containing the <code>bind</code> returns, the dynamic value will update to point at the
OLD value. The 'initial' value establishes a 'hidden' binding at the top of
the current call-stack.  
</p>

<p>
Format: <code>(dynamic &lt;initial_value&gt;)</code>
</p>

<p>
Sample usage:
</p>
<div class="org-src-container">
<pre class="src src-relic">(<span style="color: #9d81ba;">def</span> counter <span style="color: #9d81ba;">dynamic</span> <span style="color: #0D9C94;">0</span>)
</pre>
</div></dd>

<dt>use</dt><dd><p>
Access the current value of a dynamic cell.
</p>

<p>
Format: <code>(use &lt;dynamic&gt;)</code>
</p>

<p>
Sample usage:
</p>
<div class="org-src-container">
<pre class="src src-relic">(<span style="color: #9d81ba;">use</span> counter)
</pre>
</div></dd>

<dt>modify</dt><dd><p>
Modify the value of a dynamically scoped variable.
</p>

<p>
Format: <code>(modify &lt;dynamic&gt; &lt;new_value&gt;)</code>
</p>

<p>
Sample usage:
</p>
<div class="org-src-container">
<pre class="src src-relic">(<span style="color: #9d81ba;">modify</span> counter (+ (<span style="color: #9d81ba;">use</span> counter) <span style="color: #0D9C94;">1</span>))
</pre>
</div></dd>

<dt>bind</dt><dd><p>
Establish a binding for a dynamic value. The change affects all accesses
(including callees) within the scope, but all changes to the varible are
reverted when leaving the bind.
</p>

<p>
Format: <code>(bind [name value] ,&lt;body&gt;)</code>
</p>

<p>
Sample usage:
</p>
<div class="org-src-container">
<pre class="src src-relic">(terminal<span style="color: #7CF083;">.write-line</span> (to-string counter)) <span style="color: #454459;">;; </span><span style="color: #454459;">prints 0
</span>
(<span style="color: #9d81ba;">bind</span> [counter <span style="color: #0D9C94;">100</span>]
  (<span style="color: #9d81ba;">modify</span> counter (+ (<span style="color: #9d81ba;">use</span> counter) <span style="color: #0D9C94;">10</span>))      
  (terminal<span style="color: #7CF083;">.write-line</span> (to-string counter))) <span style="color: #454459;">;; </span><span style="color: #454459;">prints 110
</span>
(terminal<span style="color: #7CF083;">.write-line</span> (to-string counter)) <span style="color: #454459;">;; </span><span style="color: #454459;">prints 0</span>
</pre>
</div></dd>

<dt>instance</dt><dd><p>
Bind values to typeclass traits dynamically.
</p>

<p>
Format: <code>(instance type trait implementation)</code>
</p>

<p>
Sample usage:
</p>
<div class="org-src-container">
<pre class="src src-relic">(instance <span style="color: #62D2DB;">I64</span> <span style="color: #62D2DB;">Num</span>
  [(+ subtract multiply)])
</pre>
</div></dd>
</dl>
</div>
</div>
