spec/core/index.org
** Binding and Control Flow

+ if :: Conditional expression that evaluates and returns one of two branches, based on a boolean condition.

 Format: =(if condition true-branch false-branch)=

 Sample usage:
  #+begin_src relic
(if :true "It's true!" "It's false.") ;; Returns "It's true!"

(def pick proc [(b Bool) (x I64) (y I64)] (if b x y))
(pick :false 10 5) ;; Evaluates to 5
  #+end_src

+ cond :: Evaluate multiple condition-action pairs sequentially until one condition evaluates to true. Returns the result of the first true condition's action.

 Format: =(cond [condition action] ...)=

 Sample usage:
  #+begin_src relic
(cond 
  [:false "This won't execute"]
  [:true "This will execute first"]
  [:true "This won't execute, since the first true condition matched."])

(def weekday proc [(n U8)]
  (cond 
    [(= n 1) "Monday"]
    [(= n 2) "Tuesday"]
    [(= n 3) "Wednesday"]
    [(= n 4) "Thursday"]
    [(= n 5) "Friday"]
    [(= n 6) "Saturday"]
    [(= n 7) "Sunday"]
    [:true "Invalid Weekday!"])
  #+end_src

+ labels :: Used to define labeled blocks within expressions. Labels function
  somewhat similarly to labels in other programming languages, except they
  accept arguments, which get bound as local variables. This is usefuf for, e.g.
  writing loops or state-machines without needing pointers, refs or other
  mutable constructs. 

 Format: =(labels <body> [label <action>] ...)=

 Sample usage:
  #+begin_src relic
(labels (go-to start)
  [start [x] x]
  [end 27])

(labels (go-to loop 0)
  [loop [x] (if (< x 10)
                (go-to loop (+ x 1))
                (go-to end))]
  [end (terminal.write-line "Loop Done")])
  #+end_src

+ go-to :: Directs execution to a specific label defined within labels (see
  labels above)

 Format: =(go-to label [arguments]*)=

 Sample usage:
  #+begin_src relic
(labels (go-to val 7) [val [x] x])
  #+end_src

+ with-reset ::

+ reset-to ::

+ let ::

** Type Casting and Information

+ is :: Assert that a value is a specific type. Primary usages are to restrict the
  type of literals, to provide type information to the type checker, and to
  provide type informationto a human reader.

  Format: =(is <value> <type>)=
  
  #+begin_src relic
;; (new 3) would create a pointer to a 64-bit integer (the default)
;; (new (is 3 U32)) restricts the type of the literal to 32 bits
(new (is 3 U32))
  #+end_src

+ into :: 

+ out-of ::

+ name ::

+ unname ::
  
+ widen :: Take an integral or floating type and move into a type with strictly
  more information. For example, a U8 can be widened into an I16, but NOT an I8,
  as an I8 cannot represent values larger than 127, whereas a U8 can represent
  values up to 255.

  Format: =(widen <value> <type>)=

  Sample usage:
  #+begin_src relic

  #+end_src
  
+ narrow ::


+ size-of :: Given a type, returns the size of that type (in bytes) as an int of
  type U64. Can be used in polymorphic (all) functions also.

 Format: =(size-of <type>)=

 Sample usage:
,#+begin_src relic
(def Point Struct [.x F32] [.y F32])

;; Allocate enough memory to store 4 Points
(def pos-memory memory.allocate (* (size-of Point)))
#+end_src

+ align-of :: Given a type, returns the alignment of that type (in bytes) as an int of
  type U64. Can be used in polymorphic (all) functions also.

 Format: =(align-of <type>)=

 Sample usage:
  #+begin_src relic
(def Point Struct [.x F32] [.y F32])

(ailgn-of Point) ;; => 4
  #+end_src

+ offset-of :: Given a fieldname and a struct, returns the offset of the field
  (in bytes) relative to the start of the struct.

  Format: =(offset-of <fieldname> <type>)=

  Sample usage:

  #+begin_src relic
 (def Point Struct [.x F32] [.y F32])

 (offset-of x Point) ;; => 0
 (offset-of y Point) ;; => 4
  #+end_src


** Type formers
+ Proc :: Create a new procedure type.

  Format: =(Proc [<Types...>] <ReturnType>)=

  Sample usage: 
  #+begin_src relic
  (ann print-age Proc [I64] Unit)
  (def print-age proc [age] seq
    (terminal.write-string "Age: ")
    (terminal.write-string (to-string age)))
  #+end_src

+ Array :: 
+ Struct ::
+ Enum ::
+ Reset ::
+ Dynamic ::
+ Named ::
+ Distinct ::
+ Opaque ::
+ Trait ::
+ All ::
+ Sealed ::
+ Family ::
+ LiftCType ::

+ Type :: 
+ Unit :: 
+ Bool ::
+ Address ::
+ I64 ::
+ I32 ::
+ I16 ::
+ I8 ::
+ U64 ::
+ U32 ::
+ U16 ::
+ U8 ::
+ F32 ::
+ F64 ::

