spec/core/index.html
<div id="outline-container-orgcb73101" class="outline-3">
<h3 id="orgcb73101">Binding and Control Flow</h3>
<div class="outline-text-3" id="text-orgcb73101">
<dl class="org-dl">
<dt>if</dt><dd><p>
Conditional expression that evaluates and returns one of two branches, based on a boolean condition.
</p>

<p>
Format: <code>(if condition true-branch false-branch)</code>
</p>

<p>
Sample usage:
</p>
<div class="org-src-container">
<pre class="src src-relic">(<span style="color: #9d81ba;">if</span> <span style="color: #7CF083;">:true</span> <span style="color: #f5c791;">"It's true!"</span> <span style="color: #f5c791;">"It's false."</span>) <span style="color: #454459;">;; </span><span style="color: #454459;">Returns "It's true!"
</span>
(<span style="color: #9d81ba;">def</span> pick <span style="color: #9d81ba;">proc</span> [(b <span style="color: #62D2DB;">Bool</span>) (x <span style="color: #62D2DB;">I64</span>) (y <span style="color: #62D2DB;">I64</span>)] (<span style="color: #9d81ba;">if</span> b x y))
(pick <span style="color: #7CF083;">:false</span> <span style="color: #0D9C94;">10</span> <span style="color: #0D9C94;">5</span>) <span style="color: #454459;">;; </span><span style="color: #454459;">Evaluates to 5</span>
</pre>
</div></dd>

<dt>cond</dt><dd><p>
Evaluate multiple condition-action pairs sequentially until one condition evaluates to true. Returns the result of the first true condition's action.
</p>

<p>
Format: <code>(cond [condition action] ...)</code>
</p>

<p>
Sample usage:
</p>
<div class="org-src-container">
<pre class="src src-relic">(<span style="color: #9d81ba;">cond</span> 
  [<span style="color: #7CF083;">:false</span> <span style="color: #f5c791;">"This won't execute"</span>]
  [<span style="color: #7CF083;">:true</span> <span style="color: #f5c791;">"This will execute first"</span>]
  [<span style="color: #7CF083;">:true</span> <span style="color: #f5c791;">"This won't execute, since the first true condition matched."</span>])

(<span style="color: #9d81ba;">def</span> weekday <span style="color: #9d81ba;">proc</span> [(n <span style="color: #62D2DB;">U8</span>)]
  (<span style="color: #9d81ba;">cond</span> 
    [(= n <span style="color: #0D9C94;">1</span>) <span style="color: #f5c791;">"Monday"</span>]
    [(= n <span style="color: #0D9C94;">2</span>) <span style="color: #f5c791;">"Tuesday"</span>]
    [(= n <span style="color: #0D9C94;">3</span>) <span style="color: #f5c791;">"Wednesday"</span>]
    [(= n <span style="color: #0D9C94;">4</span>) <span style="color: #f5c791;">"Thursday"</span>]
    [(= n <span style="color: #0D9C94;">5</span>) <span style="color: #f5c791;">"Friday"</span>]
    [(= n <span style="color: #0D9C94;">6</span>) <span style="color: #f5c791;">"Saturday"</span>]
    [(= n <span style="color: #0D9C94;">7</span>) <span style="color: #f5c791;">"Sunday"</span>]
    [<span style="color: #7CF083;">:true</span> <span style="color: #f5c791;">"Invalid Weekday!"</span>])
</pre>
</div></dd>

<dt>labels</dt><dd><p>
Used to define labeled blocks within expressions. Labels function
somewhat similarly to labels in other programming languages, except they
accept arguments, which get bound as local variables. This is usefuf for, e.g.
writing loops or state-machines without needing pointers, refs or other
mutable constructs. 
</p>

<p>
Format: <code>(labels &lt;body&gt; [label &lt;action&gt;] ...)</code>
</p>

<p>
Sample usage:
</p>
<div class="org-src-container">
<pre class="src src-relic">(<span style="color: #9d81ba;">labels</span> (<span style="color: #9d81ba;">go-to</span> <span style="color: #0bc9cf;">start</span>)
  [start [x] x]
  [end <span style="color: #0D9C94;">27</span>])

(<span style="color: #9d81ba;">labels</span> (<span style="color: #9d81ba;">go-to</span> <span style="color: #0bc9cf;">loop</span> <span style="color: #0D9C94;">0</span>)
  [loop [x] (<span style="color: #9d81ba;">if</span> (&lt; x <span style="color: #0D9C94;">10</span>)
                (<span style="color: #9d81ba;">go-to</span> <span style="color: #0bc9cf;">loop</span> (+ x <span style="color: #0D9C94;">1</span>))
                (<span style="color: #9d81ba;">go-to</span> <span style="color: #0bc9cf;">end</span>))]
  [end (terminal<span style="color: #7CF083;">.write-line</span> <span style="color: #f5c791;">"Loop Done"</span>)])
</pre>
</div></dd>

<dt>go-to</dt><dd><p>
Directs execution to a specific label defined within labels (see
labels above)
</p>

<p>
Format: <code>(go-to label [arguments]*)</code>
</p>

<p>
Sample usage:
</p>
<div class="org-src-container">
<pre class="src src-relic">(<span style="color: #9d81ba;">labels</span> (<span style="color: #9d81ba;">go-to</span> <span style="color: #0bc9cf;">val</span> <span style="color: #0D9C94;">7</span>) [val [x] x])
</pre>
</div></dd>

<dt>with-reset</dt><dd></dd>


<dt>reset-to</dt><dd></dd>


<dt>let</dt><dd></dd>
</dl>
</div>
</div>
<div id="outline-container-org8e958a0" class="outline-3">
<h3 id="org8e958a0">Type Casting and Information</h3>
<div class="outline-text-3" id="text-org8e958a0">
<dl class="org-dl">
<dt>is</dt><dd><p>
Assert that a value is a specific type. Primary usages are to restrict the
type of literals, to provide type information to the type checker, and to
provide type informationto a human reader.
</p>

<p>
Format: <code>(is &lt;value&gt; &lt;type&gt;)</code>
</p>

<div class="org-src-container">
<pre class="src src-relic"><span style="color: #454459;">;; </span><span style="color: #454459;">(new 3) would create a pointer to a 64-bit integer (the default)
</span><span style="color: #454459;">;; </span><span style="color: #454459;">(new (is 3 U32)) restricts the type of the literal to 32 bits
</span>(new (<span style="color: #9d81ba;">is</span> <span style="color: #0D9C94;">3</span> <span style="color: #62D2DB;">U32</span>))
</pre>
</div></dd>

<dt>into</dt><dd></dd>


<dt>out-of</dt><dd></dd>


<dt>name</dt><dd></dd>


<dt>unname</dt><dd></dd>


<dt>widen</dt><dd><p>
Take an integral or floating type and move into a type with strictly
more information. For example, a U8 can be widened into an I16, but NOT an I8,
as an I8 cannot represent values larger than 127, whereas a U8 can represent
values up to 255.
</p>

<p>
Format: <code>(widen &lt;value&gt; &lt;type&gt;)</code>
</p>

<p>
Sample usage:
</p>
<div class="org-src-container">
<pre class="src src-relic">
</pre>
</div></dd>

<dt>narrow</dt><dd></dd>
</dl>


<dl class="org-dl">
<dt>size-of</dt><dd><p>
Given a type, returns the size of that type (in bytes) as an int of
type U64. Can be used in polymorphic (all) functions also.
</p>

<p>
Format: <code>(size-of &lt;type&gt;)</code>
</p>

<p>
Sample usage:
</p></dd>
</dl>
<p>
,#+begin_src relic
(def Point Struct [.x F32] [.y F32])
</p>

<p>
;; Allocate enough memory to store 4 Points
(def pos-memory memory.allocate (* (size-of Point)))
#+end_src
</p>

<dl class="org-dl">
<dt>align-of</dt><dd><p>
Given a type, returns the alignment of that type (in bytes) as an int of
type U64. Can be used in polymorphic (all) functions also.
</p>

<p>
Format: <code>(align-of &lt;type&gt;)</code>
</p>

<p>
Sample usage:
</p>
<div class="org-src-container">
<pre class="src src-relic">(<span style="color: #9d81ba;">def</span> <span style="color: #62D2DB;">Point</span> <span style="color: #9d81ba;">Struct</span> [<span style="color: #7CF083;">.x</span> <span style="color: #62D2DB;">F32</span>] [<span style="color: #7CF083;">.y</span> <span style="color: #62D2DB;">F32</span>])

(ailgn-of <span style="color: #62D2DB;">Point</span>) <span style="color: #454459;">;; </span><span style="color: #454459;">=&gt; 4</span>
</pre>
</div></dd>

<dt>offset-of</dt><dd><p>
Given a fieldname and a struct, returns the offset of the field
(in bytes) relative to the start of the struct.
</p>

<p>
Format: <code>(offset-of &lt;fieldname&gt; &lt;type&gt;)</code>
</p>

<p>
Sample usage:
</p>

<div class="org-src-container">
<pre class="src src-relic"> (<span style="color: #9d81ba;">def</span> <span style="color: #62D2DB;">Point</span> <span style="color: #9d81ba;">Struct</span> [<span style="color: #7CF083;">.x</span> <span style="color: #62D2DB;">F32</span>] [<span style="color: #7CF083;">.y</span> <span style="color: #62D2DB;">F32</span>])

 (offset-of x <span style="color: #62D2DB;">Point</span>) <span style="color: #454459;">;; </span><span style="color: #454459;">=&gt; 0
</span> (offset-of y <span style="color: #62D2DB;">Point</span>) <span style="color: #454459;">;; </span><span style="color: #454459;">=&gt; 4</span>
</pre>
</div></dd>
</dl>
</div>
</div>
<div id="outline-container-orga800413" class="outline-3">
<h3 id="orga800413">Type formers</h3>
<div class="outline-text-3" id="text-orga800413">
<dl class="org-dl">
<dt>Proc</dt><dd><p>
Create a new procedure type.
</p>

<p>
Format: <code>(Proc [&lt;Types...&gt;] &lt;ReturnType&gt;)</code>
</p>

<p>
Sample usage: 
</p>
<div class="org-src-container">
<pre class="src src-relic">  (<span style="color: #9d81ba;">ann</span> print-age <span style="color: #9d81ba;">Proc</span> [<span style="color: #62D2DB;">I64</span>] <span style="color: #62D2DB;">Unit</span>)
  (<span style="color: #9d81ba;">def</span> print-age <span style="color: #9d81ba;">proc</span> [age] <span style="color: #9d81ba;">seq</span>
    (terminal<span style="color: #7CF083;">.write-string</span> <span style="color: #f5c791;">"Age: "</span>)
    (terminal<span style="color: #7CF083;">.write-string</span> (to-string age)))
</pre>
</div></dd>

<dt>Array</dt><dd></dd>

<dt>Struct</dt><dd></dd>

<dt>Enum</dt><dd></dd>

<dt>Reset</dt><dd></dd>

<dt>Dynamic</dt><dd></dd>

<dt>Named</dt><dd></dd>

<dt>Distinct</dt><dd></dd>

<dt>Opaque</dt><dd></dd>

<dt>Trait</dt><dd></dd>

<dt>All</dt><dd></dd>

<dt>Sealed</dt><dd></dd>

<dt>Family</dt><dd></dd>

<dt>LiftCType</dt><dd></dd>


<dt>Type</dt><dd></dd>

<dt>Unit</dt><dd></dd>

<dt>Bool</dt><dd></dd>

<dt>Address</dt><dd></dd>

<dt>I64</dt><dd></dd>

<dt>I32</dt><dd></dd>

<dt>I16</dt><dd></dd>

<dt>I8</dt><dd></dd>

<dt>U64</dt><dd></dd>

<dt>U32</dt><dd></dd>

<dt>U16</dt><dd></dd>

<dt>U8</dt><dd></dd>

<dt>F32</dt><dd></dd>

<dt>F64</dt><dd></dd>
</dl>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Connor Fynn Redfern</p>
<p class="date">Created: 2026-05-31 Sun 13:20</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
